<a href="https://colab.research.google.com/github/LaraAyrolla/Python-Projects/blob/main/simple-lists/Python-List-8.2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Programação de Soluções Computacionais**


8.2ª LISTA DE EXERCÍCIOS - SQL - PYTHON

In [135]:
import sqlite3

In [136]:
# 1 - Crie um banco de dados chamado exercicio1.db

conn = sqlite3.connect('exercicio.db')
cursor = conn.cursor()

In [137]:
# 2 - Crie uma tabela chamada 'cursos' para armazenar informações sobre os cursos.
# A tabela deve ter uma coluna id que será a chave primária e outra com o nome do curso.

sql = '''CREATE TABLE cursos(
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  nome VARCHAR(100) NOT NULL
)'''

cursor.execute(sql)

In [138]:
# 3 - Crie uma tabela chamada 'alunos' com as seguintes colunas:
# id, nome, nota e curso_id

sql = '''CREATE TABLE alunos(
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  nome VARCHAR(100) NOT NULL,
  nota FLOAT NOT NULL,
  curso_id INTEGER,
  FOREIGN KEY(curso_id) REFERENCES cursos(id)
)'''

cursor.execute(sql)

In [139]:
# 4 - Insira os cursos:
# (1, 'Matemática'),
# (2, 'História'),
# (3, 'Ciências'),
# (4, 'Inglês'),
# (5, 'Programação')

sql = 'INSERT INTO cursos (nome) VALUES(?)'

cursos = [['Matemática'],['História'],['Ciências'],['Inglês'],['Programação']]

for curso in cursos:
    cursor.execute(sql, curso)
    print(curso)

conn.commit()

['Matemática']
['História']
['Ciências']
['Inglês']
['Programação']

In [140]:
# 5 - Insira alguns registros na tabela 'alunos' com referência aos cursos

# (1, 'Alice', 20, 9.5, 1), # Matemática
# (2, 'Bob', 22, 8.0, 2), # História
# (3, 'Carol', 21, 7.5, 1), # Matemática
# (4, 'David', 23, 8.8, 3), # Ciências
# (5, 'Eve', 19, 9.0, 2) # História
# (6, 'Frank', 24, 8.7, 1), # Matemática
# (6, 'Frank', 24, 8.7, 4) # Inglês

sql = 'INSERT INTO alunos (nome, nota, curso_id) VALUES(?,?,?)'

alunos = [
  ['Alice', '9.5', '1'],['Bob', '8', '2'],\
  ['Carol', '7.5', '1'],['David', '8.8', '3'],\
  ['Eve', '9', '2'],['Frank', '8.7', '1'],['Frank', '8.7', '4']\
]

for aluno in alunos:
    cursor.execute(sql, aluno)
    print(aluno)

conn.commit()

['Alice', '9.5', '1']
['Bob', '8', '2']
['Carol', '7.5', '1']
['David', '8.8', '3']
['Eve', '9', '2']
['Frank', '8.7', '1']
['Frank', '8.7', '4']

In [141]:
# 6 - Faça consultas SQL para recuperar informações dos alunos e seus cursos

# a. Selecione todos os alunos e seus cursos

sql = '''SELECT
    a.id,
    a.nome,
    a.nota,
    c.nome as curso,
    c.id as curso_id
  FROM alunos a
  INNER JOIN cursos c ON c.id = a.curso_id
'''

alunos = cursor.execute(sql)

for aluno in alunos:
    print(aluno)

(1, 'Alice', 9.5, 'Matemática', 1)
(2, 'Bob', 8.0, 'História', 2)
(3, 'Carol', 7.5, 'Matemática', 1)
(4, 'David', 8.8, 'Ciências', 3)
(5, 'Eve', 9.0, 'História', 2)
(6, 'Frank', 8.7, 'Matemática', 1)
(7, 'Frank', 8.7, 'Inglês', 4)

In [142]:
# b. Selecione os alunos com notas acima de 7

sql = '''SELECT
    a.id,
    a.nome,
    a.nota
  FROM alunos a
  WHERE a.nota > 7
'''
alunos = cursor.execute(sql)

for aluno in alunos:
    print(aluno)

(1, 'Alice', 9.5)
(2, 'Bob', 8.0)
(3, 'Carol', 7.5)
(4, 'David', 8.8)
(5, 'Eve', 9.0)
(6, 'Frank', 8.7)
(7, 'Frank', 8.7)

In [143]:
# c. Selecione os alunos com nota acima de 7 e seus respectivos cursos

sql = '''SELECT
    a.id,
    a.nome,
    a.nota,
    c.nome as curso,
    c.id as curso_id
  FROM alunos a
  INNER JOIN cursos c ON c.id = a.curso_id
  WHERE a.nota > 7
'''
alunos = cursor.execute(sql)

for aluno in alunos:
    print(aluno)

(1, 'Alice', 9.5, 'Matemática', 1)
(2, 'Bob', 8.0, 'História', 2)
(3, 'Carol', 7.5, 'Matemática', 1)
(4, 'David', 8.8, 'Ciências', 3)
(5, 'Eve', 9.0, 'História', 2)
(6, 'Frank', 8.7, 'Matemática', 1)
(7, 'Frank', 8.7, 'Inglês', 4)

In [144]:
# 7 - Crie um script para alterar a tabela de 'alunos' retirando as colunas nota e curso_id

createNewAlunosTable = 'CREATE TABLE new_alunos AS SELECT id, nome FROM alunos'
dropOldAlunosTable = 'DROP TABLE alunos'
renameNewAlunosTable = 'ALTER TABLE new_alunos RENAME TO alunos'

In [145]:
# 8 - Crie uma tabela 'Disciplinas' para receber as colunas nota e curso_id que
# devem ser retiradas da tabela alunos e os dados respectivos e adicione uma chave
# estrangeira para o aluno_id

sql = '''CREATE TABLE disciplinas(
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  nota FLOAT NOT NULL,
  aluno_id INTEGER,
  curso_id INTEGER,
  FOREIGN KEY(aluno_id) REFERENCES alunos(id),
  FOREIGN KEY(curso_id) REFERENCES cursos(id)
)'''

cursor.execute(sql)

sql = '''INSERT INTO disciplinas
  (nota, aluno_id, curso_id)
  SELECT a.nota, a.id, a.curso_id FROM alunos a
'''

cursor.execute(sql)

In [148]:
cursor.execute(createNewAlunosTable)
cursor.execute(dropOldAlunosTable)
cursor.execute(renameNewAlunosTable)

sql = '''SELECT
    a.id,
    a.nome
  FROM alunos a
'''

alunos = cursor.execute(sql)

for aluno in alunos:
    print(aluno)

(1, 'Alice')
(2, 'Bob')
(3, 'Carol')
(4, 'David')
(5, 'Eve')
(6, 'Frank')
(7, 'Frank')

In [150]:
sql = '''SELECT
    d.id,
    d.nota,
    a.nome as aluno,
    a.id as alunos_id,
    c.nome as curso,
    c.id as curso_id
  FROM disciplinas d
  INNER JOIN cursos c ON c.id = d.curso_id
  INNER JOIN alunos a ON a.id = d.aluno_id
'''

disciplinas = cursor.execute(sql)

for disciplina in disciplinas:
    print(disciplina)

(1, 9.5, 'Alice', 1, 'Matemática', 1)
(2, 8.0, 'Bob', 2, 'História', 2)
(3, 7.5, 'Carol', 3, 'Matemática', 1)
(4, 8.8, 'David', 4, 'Ciências', 3)
(5, 9.0, 'Eve', 5, 'História', 2)
(6, 8.7, 'Frank', 6, 'Matemática', 1)
(7, 8.7, 'Frank', 7, 'Inglês', 4)